# -*- coding: utf-8 -*-


ERROR_MSG_MAP = {
    200: 'success',
    400: '请求无效',
    401: '未提供认证信息',
    402: '认证信息过期，请重新登录',
    403: '错误的认证信息',
    404: '请求内容不存在',
    405: '不允许的操作',
    407: '请求参数不正确',
    408: '名称已存在',
    409: '操作将导致数据不一致',
    410: '用户名已存在',
    421: '用户名或密码错误',
    422: '请求缺少必要参数',
    423: '请求参数数据类型不正确',
    450: '创建新品牌失败',
    451: '店铺名已存在',
    452: '尚未在百度智客注册',
    453: '创建新店铺失败',
    500: '请求错误，请联系管理员',
    501: 'JSON格式错误',
    701: 'Partner不存在',
    702: '部分唯一参数重复',
}

DATE_FORMAT = "%Y-%m-%d 00:00:00"

